"""
Обучение нейрона распознавать буквы "П" и "Ш".


----------------Буква П-------------------
В массив array добавим два варианта:
1 вариант (обычная П):
1, 1, 1, 1, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1

2 вариант (правый столбец 0-вой):
1, 1, 1, 1, 0
1, 0, 0, 1, 0
1, 0, 0, 1, 0
1, 0, 0, 1, 0
1, 0, 0, 1, 0


----------------Буква Ш-------------------
В массив array добавим два варианта:
1 вариант (обычная Ш):
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 1, 1, 1, 1

2 вариант (верхняя строка 0-вая):
0, 0, 0, 0, 0
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 1, 1, 1, 1
"""

import numpy as np
from pprint import pprint

w1 = np.zeros(25)  # для буквы П
w2 = np.zeros(25)  # для буквы Ш

array = np.array([
    [1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1],  # буква П (1 вариант)
    [1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0],  # буква П (2 вариант)
    [1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1],  # буква Ш (1 вариант)
    [0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1],  # буква Ш (2 вариант)
])

arr_1 = np.array([1, 1, 0, 0])  # буква П
arr_2 = np.array([0, 0, 1, 1])  # буква Ш
alfa = 0.2
betta = -0.4
sigma = lambda x: 1 if x > 0 else 0


def f1(x):  # для буквы П
    s = betta + np.sum(x @ w1)
    return sigma(s)


def f2(x):  # для буквы Ш
    s = betta + np.sum(x @ w2)
    return sigma(s)


def train1():  # для буквы П
    global w1
    w1_copy = w1.copy()
    for x, y in zip(array, arr_1):
        w1 += alfa * (y - f1(x)) * x
    return (w1 != w1_copy).any()


def train2():  # для буквы Ш
    global w2
    w2_copy = w2.copy()
    for x, y in zip(array, arr_2):
        w2 += alfa * (y - f2(x)) * x
    return (w2 != w2_copy).any()


while train1() and train2():
    print('The program is completed.')

pprint(w1.reshape((5, 5)))
pprint(w2.reshape((5, 5)))

print(f'Для\n{array[:1]}\nзначение f1(x) = {f1(array[:1])}, представлена буква П.\n')
print(f'Для\n{array[1:2]}\nзначение f1(x) = {f1(array[1:2])}, представлена буква П.\n')
print(f'Для\n{array[2:3]}\nзначение f2(x) = {f2(array[1:3])}, представлена буква Ш.\n')
print(f'Для\n{array[3:]}\nзначение f2(x) = {f2(array[3:])}, представлена буква Ш.\n')

# Тестируем различные варианты:
# Для буквы "П":
# 1 вариант (левый столбец 0-вой):
"""
0, 1, 1, 1, 1
0, 1, 0, 0, 1
0, 1, 0, 0, 1
0, 1, 0, 0, 1
0, 1, 0, 0, 1
"""

# 2 вариант (нижняя строка 0-вая):
"""
1, 1, 1, 1, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
0, 0, 0, 0, 0
"""

# 3 вариант (верхняя строка 0-вая):
"""
0, 0, 0, 0, 0
1, 1, 1, 1, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
1, 0, 0, 0, 1
"""

# 4 вариант (левый и правый столбцы 0-вые):
"""
0, 1, 1, 1, 0
0, 1, 0, 1, 0
0, 1, 0, 1, 0
0, 1, 0, 1, 0
0, 1, 0, 1, 0
"""

# Для буквы "Ш":
# 5 вариант (верхние 2 строки 0-вые):
"""
0, 0, 0, 0, 0
0, 0, 0, 0, 0
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 1, 1, 1, 1
"""

# 6 вариант (нижняя строка 0-вая):
"""
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 1, 1, 1, 1
0, 0, 0, 0, 0
"""

# 7 вариант (верхняя и нижняя строки 0-вые):
"""
0, 0, 0, 0, 0
1, 0, 1, 0, 1
1, 0, 1, 0, 1
1, 1, 1, 1, 1
0, 0, 0, 0, 0
"""

array_test = np.array([
    [0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1],  # 1 вариант
    [1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0],  # 2 вариант
    [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1],  # 3 вариант
    [0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0],  # 4 вариант
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1],  # 5 вариант
    [1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0],  # 6 вариант
    [0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0],  # 7 вариант
])

for x in array_test:
    """
    Ожидаемый результат:
    1 0
    1 0
    1 0
    1 0
    0 1
    0 1
    0 1
    """
    print(f1(x), f2(x))
    # output:
    # 1 0
    # 1 0
    # 1 0
    # 1 0
    # 0 1
    # 0 1
    # 0 1



# ИТОГОВЫЙ ВЫВОД ВСЕГО:
"""
The program is completed.
The program is completed.
array([[ 0.2,  0.6,  0.2,  0.6,  0. ],
       [ 0.2,  0. , -0.4,  0.2,  0. ],
       [ 0.2,  0. , -0.4,  0.2,  0. ],
       [ 0.2,  0. , -0.4,  0.2,  0. ],
       [ 0.2, -0.4, -0.4, -0.2,  0. ]])
array([[ 0. , -0.2,  0. , -0.2,  0. ],
       [ 0. ,  0. ,  0.2,  0. ,  0. ],
       [ 0. ,  0. ,  0.2,  0. ,  0. ],
       [ 0. ,  0. ,  0.2,  0. ,  0. ],
       [ 0. ,  0.2,  0.2,  0.2,  0. ]])
Для
[[1 1 1 1 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1 1 0 0 0 1]]
значение f1(x) = 1, представлена буква П.

Для
[[1 1 1 1 0 1 0 0 1 0 1 0 0 1 0 1 0 0 1 0 1 0 0 1 0]]
значение f1(x) = 1, представлена буква П.

Для
[[1 0 1 0 1 1 0 1 0 1 1 0 1 0 1 1 0 1 0 1 1 1 1 1 1]]
значение f2(x) = 1, представлена буква Ш.

Для
[[0 0 0 0 0 1 0 1 0 1 1 0 1 0 1 1 0 1 0 1 1 1 1 1 1]]
значение f2(x) = 1, представлена буква Ш.

1 0
1 0
1 0
1 0
0 1
0 1
0 1

Process finished with exit code 0
"""